MustafaOrhon/STM32-F401RE-Projects-using-SPL/012_1_STD_I2C_2x16_LCD_Display/src/main.c

#include "stm32f4xx.h"
#include "i2c-lcd.h"
GPIO_InitTypeDef GPIO_InitStruct;
I2C_InitTypeDef I2C_InitStruct;
uint8_t m_address = 0x4E;
int i=0;
void delay(uint32_t time)
{
  while(time--);
}
void GPIO_Config()
{
   RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOB,ENABLE);

   GPIO_PinAFConfig(GPIOB,GPIO_PinSource8,GPIO_AF_I2C1); //SCL PIN
   GPIO_PinAFConfig(GPIOB,GPIO_PinSource9,GPIO_AF_I2C1); //SDA PIN

   GPIO_InitStruct.GPIO_Mode = GPIO_Mode_AF;
   GPIO_InitStruct.GPIO_OType = GPIO_OType_OD;  //!!
   GPIO_InitStruct.GPIO_Pin = GPIO_Pin_8|GPIO_Pin_9;
   GPIO_InitStruct.GPIO_PuPd = GPIO_PuPd_NOPULL;
   GPIO_InitStruct.GPIO_Speed = GPIO_Speed_100MHz;

   GPIO_Init(GPIOB,&GPIO_InitStruct);

}
void I2C_Config()
{
    RCC_APB1PeriphClockCmd(RCC_APB1Periph_I2C1,ENABLE);

    I2C_InitStruct.I2C_Ack = I2C_Ack_Enable;
    I2C_InitStruct.I2C_AcknowledgedAddress = I2C_AcknowledgedAddress_7bit;
    I2C_InitStruct.I2C_ClockSpeed = 400000;
    I2C_InitStruct.I2C_DutyCycle = I2C_DutyCycle_2;
    I2C_InitStruct.I2C_Mode = I2C_Mode_I2C;
    I2C_InitStruct.I2C_OwnAddress1 = 0x00;

    I2C_Init(I2C1,&I2C_InitStruct);
    I2C_Cmd(I2C1,ENABLE);

}

void I2C_Write(uint8_t address,uint8_t data)
{
	while(I2C_GetFlagStatus(I2C1,I2C_FLAG_BUSY)); //Wait if i2c flag is busy

	I2C_GenerateSTART(I2C1,ENABLE); //Start transmit data
	while(!(I2C_CheckEvent(I2C1,I2C_EVENT_MASTER_MODE_SELECT)));

	I2C_Send7bitAddress(I2C1,address,I2C_Direction_Transmitter);
	while(!(I2C_CheckEvent(I2C1,I2C_EVENT_MASTER_BYTE_TRANSMITTING))); //Wait while transmitting bit
	I2C_SendData(I2C1,data);  //Send data
	I2C_GenerateSTOP(I2C1,ENABLE);

}


int main(void)
{
 GPIO_Config();
 I2C_Config();
 lcd_init();
 lcd_send_cmd(0x01);
 delay(2100000);
  while (1)
  {

   lcd_send_string("Mustafa");

  }
}
